<center><h2> Part 1 </h2></center>

In this HW assignment, you will analyze a dataset regarding the number of international students studying at 500 US universities. The attached "students.csv" contains the name of the university and the number of international students enrolled in each university in 2017. 

The dataset comes from the US Department of Education's website.

In [1]:
import pandas as pd

### Question 1 (1pt)
Write a one-line code snippet that imports the "students.csv" file into a dataframe, named "students", and sets the **School** column as the index of the dataset

In [2]:
#your answer here

In [3]:
students.head()

                                           Students
School
Academy of Art University                      6404
Adelphi University                              950
American College of Commerce & Technology      1677
American Language Communication Center         2607
American Language Institute                    2557

### Question 2 (1pts)
Write a one-line code snippet that returns the total number of international students across all the universities in the dataset in 2017. Your code snippet should return a single number as an int.

In [4]:
#your answer here

1260512

### Question 3 (2pts)
Write a one-line code snippet that returns the number of international students at "Northeastern University" in 2017.

In [6]:
#your answer here

17304

### Question 4 (3pts)
Write a one-line code snippet that returns the name of the university with the greatest number of international students. The name of the university should be returned as a string.

In [7]:
#your answer here

'New York University'

### Question 5 (4pts)
Write a code snippet that returns the list of universities where the number of international students is greater than the number of international students at Northeastern University. Your code should return a dataframe containing the list of universities along with their student numbers. **The list should be presented in descending order based on the number of students.**

In [8]:
#your answer here

                                             Students
School
New York University                           22238.0
University of Southern California             18786.0
Columbia University in the City of New York   18332.0

<center><h2> Part 2 </h2></center>

In this part, you will build on the previous part and answer some additional questions about the international students at top US universities. The attached "universities.csv" file contains more information about the top 10 universities with the largest international student populations. 

The dataset contains the name of the university and city and state information for the university, as well as the overall student population (total number of students, including both domestic and international students).

### Question 6 (1pt)
Write a one-line code snippet that imports the "universities.csv" file into a dataframe, named "universities".

In [9]:
#your answer here

In [10]:
universities

,University,City,State,Population
0,New York University,New York City,new york,51123
1,University of Southern California,Los Angeles,California,44000
2,Columbia University in the City of New York,New York City,New York,32429
3,Northeastern University,Boston,Massachusetts,27260
4,University of Illinois,Champaign,Illinois,44087
5,Arizona State University,Tempe,ARIZONA,71946
6,Purdue University,West Lafayette,Indiana,41573
7,The Pennsylvania State University,Centre County,Pennsylvania,98783
8,University of California at Berkeley,Berkeley,california,41910
9,Boston University,Boston,Massachusetts,32551

### Question 7 (3pts)
Write a one-line code snippet that combines the universities dataframe you just defined and students dataframe you used in Part 1 into a new dataframe, **combined**. The new dataframe should include all columns from both datasets for only the universities found in both, as shown in the sample output below.
* In this dataframe, Population refers to the total number of students (both domestic and international), whereas Students refers to the number of international students only.

In [11]:
#your answer here

In [12]:
combined

,University,City,State,Population,Students
0,New York University,New York City,new york,51123,22238
1,University of Southern California,Los Angeles,California,44000,18786
2,Columbia University in the City of New York,New York City,New York,32429,18332
3,Northeastern University,Boston,Massachusetts,27260,17304
4,University of Illinois,Champaign,Illinois,44087,14735
5,Arizona State University,Tempe,ARIZONA,71946,14647
6,Purdue University,West Lafayette,Indiana,41573,13609
7,The Pennsylvania State University,Centre County,Pennsylvania,98783,12876
8,University of California at Berkeley,Berkeley,california,41910,12779
9,Boston University,Boston,Massachusetts,32551,11955

### Question 8 (5pts)
Examine the State column in the dataframe above. You will see that some state names are all capitalized while others are typed in all lowercase letters. And we want to fix that. :)

* Write a code snippet that defines a function to converts all state names to title case (so that each initial is capitalized) and then uses this function to transform the State column in the dataframe. 
* You should one of the data transformation methods we covered in class.

In [13]:
#your answer here

In [14]:
combined

,University,City,State,Population,Students
0,New York University,New York City,New York,51123,22238
1,University of Southern California,Los Angeles,California,44000,18786
2,Columbia University in the City of New York,New York City,New York,32429,18332
3,Northeastern University,Boston,Massachusetts,27260,17304
4,University of Illinois,Champaign,Illinois,44087,14735
5,Arizona State University,Tempe,Arizona,71946,14647
6,Purdue University,West Lafayette,Indiana,41573,13609
7,The Pennsylvania State University,Centre County,Pennsylvania,98783,12876
8,University of California at Berkeley,Berkeley,California,41910,12779
9,Boston University,Boston,Massachusetts,32551,11955

### Question 9 (2pts)
Write a one-line code snippet that computes a new Proportion column for the proportion of international students to the overall student population at the universities found in the previous dataframe

In [15]:
#your answer here

In [16]:
combined

,University,City,State,Population,Students,Proportion
0,New York University,New York City,New York,51123,22238,43.499012
1,University of Southern California,Los Angeles,California,44000,18786,42.695455
2,Columbia University in the City of New York,New York City,New York,32429,18332,56.529649
3,Northeastern University,Boston,Massachusetts,27260,17304,63.477623
4,University of Illinois,Champaign,Illinois,44087,14735,33.422551
5,Arizona State University,Tempe,Arizona,71946,14647,20.358324
6,Purdue University,West Lafayette,Indiana,41573,13609,32.735189
7,The Pennsylvania State University,Centre County,Pennsylvania,98783,12876,13.034631
8,University of California at Berkeley,Berkeley,California,41910,12779,30.491529
9,Boston University,Boston,Massachusetts,32551,11955,36.726982

### Question 10 (8pts)
Write a code snippet that groups the universities in the combined dataframe by State. Your code should display a summary dataframe, **grouped_by_state**, containing 
    * the number of universities from each state, 
    * the average number of international students in each state, and 
    * the density of the international students at universities from each state.

Student density will be computed based on the Proportion column:
    * If the average value of the Proportion column for the universities in each state is greater than 50, the density should be "High".
    * If the average is greater than 30, then the density should be "Moderate"
    * If the average is less than 30, the density should be "Low"
    
**Please study the sample output below.**

In [17]:
#your answer here

In [15]:
grouped_by_state

              Proportion                 Students
                   count student_density     mean
State
Arizona                1             Low  14647.0
California             2        Moderate  15782.5
Illinois               1        Moderate  14735.0
Indiana                1        Moderate  13609.0
Massachusetts          2            High  14629.5
New York               2            High  20285.0
Pennsylvania           1             Low  12876.0